{"pageProps":{"post":{"id":"explanation","title":"Explanation","contents":"# Explanation\n\nA statement about what is there, what it does, and how and why. [Creativity] is used to create new [explanations]. Some explanations have reach, which is the ability of some explanation to solve problems beyond those that they were created to solve[^tboi].\n\n## Good vs. Bad Explanations\n\nAn explanation that is easy to vary while still accounting for what it purports to account for is a bad explanation.\n\nJudging quality as good vs. bad is often based on how easy it would be to vary while making it better[^awoich3]: an overly verbose and roundabout program can be shortened; a portrait of someone might be inaccurate.\n\n[^tboi]: Deutsch, The Beginning of Infinity.\n[^awoich3]: Hackethal, A Window on Intelligence: The Philosophy of People, Software, and Evolution – and Its Implications, Chapter 3.\n\n[Creativity]: ./creativity.md\n[explanations]: ./explanation.md\n","outboundLinks":[],"inboundLinks":[{"id":"creativity","context":"Creativity is the ability to create new **explanations**.","title":"Creativity"},{"id":"explanation","context":"A statement about what is there, what it does, and how and why. Creativity is used to create new **explanations**. Some explanations have reach, which is the ability of some explanation to solve problems beyond those that they were created to solve.","title":"Explanation"},{"id":"intelligence","context":"Intelligence requires creativity to generate **explanations** and critique them. The product of intelligence is knowledge.","title":"Intelligence"},{"id":"rationality","context":"Rationality is attempting to solve problems by seeking good **explanations**; actively pursuing error-correction by creating criticisms of both existing ideas and new proposals.","title":"Rationality"},{"id":"science","context":"Science is the search for good **explanations** that are falsifiable via tests, as per the criterion of demarcation.","title":"Science"}]}},"__N_SSG":true}