{"pageProps":{"post":{"id":"knowledge","title":"Knowledge","contents":"# Knowledge\n\nKnowledge is produced by an [evolutionary] process (variation and selection or conjectures and criticism).\n\nIn the case of genes, this is naturally done through errors introduced when it is copied and selection is done by which gene causes more reproduction. For ideas, this is done by unconsciously varying ideas, producing new ones, and selecting them based on which idea is more useful[^doexp11].\n\n## Types of Knowledge\n\n- **Explanatory**: a statement about what is there, what it does, and how and why\n- **Background**: familiar and currently uncontroversial knowledge\n- **Implicit**: knowledge that cannot be quite put into words, though in some cases we may be able to do so upon further inspection: I cannot tell you how I tie my shoelaces — I just do it — but if I watch myself closely as I do it, I can explain to you how I do it[^awoich3].\n\n## Knowledge and Intelligence\n\n> The presence of knowledge does not imply intelligence[^doexp11].\n\nMachine learning algorithms can contain knowledge, e.g. whether a picture contains a cat or a dog, but that does not imply that it is intelligent. In the same way, a dog can seem to be playing jenga but that does not mean it is doing the creative problem-solving to do so (it might just be looking at its owner's face to gauge how to act).\n\n## An Appearance of Design\n\nIf we encounter something that contains knowledge, it often has the _apperance_ of having been designed[^doexp11]. Theories like creationism and intelligent design then extrapolate that there must be a designer. This is not necessarily the case, although it can be, e.g. humans breeding dogs to be submissive and behave in certain ways.\n\n## Substrate Independence\n\nKnowledge is not dependant on its substrate. The same information that is contained in DNA can be written as a file on a disk, on a paper, or in a million of other ways[^doexp11].\n\n[^doexp11]: [Do Explain with Christofer Lövgren, #11 - A Window on Intelligence, with Dennis Hackethal](https://overcast.fm/+UkR4YsdR4)\n[^awoich3]: Hackethal, A Window on Intelligence: The Philosophy of People, Software, and Evolution – and Its Implications, Chapter 3.\n\n[evolutionary]: ./evolution.md\n","outboundLinks":[],"inboundLinks":[{"id":"critical-rationalism","context":"Critical rationalism is an epistemological philsophy that says that all **knowledge** should be rationally criticized. It was created by Karl Popper. Critical rationalism is built upon the underlying philosophical claim of fallibilism.","title":"Critical Rationalism"},{"id":"evolution","context":"Evolution is the creation of **knowledge** through alternating variation and selection. It is fundamentally the theory of abstract replicators .","title":"Evolution"},{"id":"fallibilism","context":"The recognition that there are no authoritative sources of **knowledge**, nor any reliable means of justifying knowledge as true or probable. The Criterion of Reality is used to figure out what is real and what is not.","title":"Fallibilism"},{"id":"gene","context":"Genes are a type of **knowledge** encoded as DNA inside of living organisms that is subject to evolution.","title":"Gene"},{"id":"intelligence","context":"Intelligence requires creativity to generate explanations and critique them. The product of intelligence is **knowledge**.","title":"Intelligence"}]}},"__N_SSG":true}