{"pageProps":{"post":{"id":"six-step-assertiveness-process","title":"A six-step assertion process","contents":"# A six-step assertion process\n\nHere is an outline of the six-step assertion process suggested by Bolton in his book _People Skills_[^psch10]:\n\n## 1. Preparation\n\n- Write the [Three-Part Assertion Message]\n- Ask yourself:\n  - Am I refraining from trespassing on the other person's space?\n  - Is this a persistant concern?\n  - Do I have a base of trust with the other person?\n  - Am I likely to get my needs met by making the assertion?\n- Rehearse the interaction in your head. Expect defensiveness.\n- Schedule a time for when you will deliver your message. Avoid the hour before dinner when everyone is tired, hungry and irritable.\n\n## 2. Sending the message\n\n- **Don't include too much small talk.** It is likely that the other person has sensed that something is headed their way. It also makes you seem less serious.\n- Your **body language** also needs to be assertive. If you are too submissive, you may not be taken seriously. If you are too aggressive, you will not foster a cooperative spirit -- it may even provoke revenge or spite.\n  - Face the other person squarely, stand or sit erect\n  - Maintain an open position with arms and legs uncrossed\n  - Keep steady eye contact. The occasional glance away is fine\n  - Your facial expression should match your message. Don't, for example, smile if you are angry\n  - Avoid excessive gesturing as it may distract from the message, but feel free to emphasize certain points with gestures\n  - Keep a calm yet firm voice. Vent your emotions while you write your statement, not while delivering it\n  - Breathe calmly and steadily.\n\n## 3. Silence\n\n- Be silent. Your silence allows the other to think about what you said or speak whatever is on their minds.\n\n## 4. Reflective listening to the other's defensive response\n\n- The response will likely be defensive. Defensiveness needs to be vented before the other person is willing to meet the needs of the asserter.\n- Shift gears to listen refectively to the predictable defensive response.\n- Reflective listening helps with breaking the vicious cycle of increasing defensiveness.\n- The data received from the other person's response may often modify our need to continue the assertion.\n- You might also discover a need of the other person that conflicts with yours. You may need to switch to doing collaborative problem solving.\n- This is a good chance to receive a lot of data about how the other person views your relationship. You may get a lot of ideas of how the relationship can be improved (note these for later and do not respond to these right away).\n- Do your best to avoid getting sidetracked.\n- Acknowledgement of your feelings or offerings of solutions may come camoflagued at first. Try to catch these if you can and reflect them back to the listener.\n\nDealing with defensiveness:\n\n- It may come in the form of a **question**, which may make it difficult for your to be assertive. Turn it into a statement and reflect it back to the other person.\n- It may get turned into a **debate**, you must refuse to engage in a debate and practice reflective listening.\n- It may come as **crying**, which is often a manipulative way to avoid confrontations and dodge any behavioral change. Believe that the tears are real and that the person is sad about being confronted, and then gently but firmly reassert. Offer to talk later if needed.\n- It may come as **withdrawal**, e.g. silence, muted body language, and a pokerface. They are communicating that they're feeling uncomfortable and defensive. Provide silence and then reassert. Assume cooperation if the silence continues.\n\n## 5. Recycling steps 2 through 4 as needed\n\n- Your may need to reassert your statement multiple times after dismantling defensiveness. Remember to follow it with silence again.\n- Use the same words when reasserting to protect your statement from being contaminated by blame, put-downs or irrelevant statements.\n- Typically, it requires three to ten repetitions of the assertion message, followed by silence each time, to change the other's behavior.\n- The above process may need a few repetitions to be effective. See example below.\n\n![An example of repeating steps 2 through 4 as needed to find a solution.](./images/six-step-assertiveness-example.png)\n\n## 6. Focusing on a solution\n\n- Given enough space, the other person will suggest a solution themselves.\n- Make sure the solution meets your needs but be flexible and open to a broad range of options.\n- Simply reflect the solution and say thanks.\n- Don't back the other person into a corner by forcing them to adopt your solution.\n- Don't insist that the other person be cheerful about meeting your needs.\n- Arrange a time to time when you will check with each other to make sure the solution is working. Don't accept responses simply designed to get your off of the other person's back.\n\n[three-part assertion message]: ./three-part-assertiveness-messages.md\n\n[^psch10]: Bolton, People Skills, Chapter 10.\n","outboundLinks":[],"inboundLinks":[]}},"__N_SSG":true}