{"pageProps":{"post":{"id":"three-part-assertiveness-messages","title":"Three-part Assertiveness Messages","contents":"# Three-part Assertiveness Messages\n\nA three-part assertiveness message consists of three parts[^psch9]:\n\n1. A nonjudgmental description of the behavior to be changed\n2. A disclosure of the asserter's feelings\n3. A clarification of the concrete and tangible effect of the other person's behavior on the asserter\n\n## Tips\n\nThese are Bolton's tips for writing effective assertion messages[^psch9]:\n\n- Describe the behavior in specific rather than fuzzy terms:\n\n  \"When you don't shovel the snow from the driveway before going to school...\" vs. \"When you don't do your part around the house...\"\n\n- Limit yourself to behavioral descriptions and do not draw inferences about the other person's motives, attitudes, character, and so on:\n\n  \"When you were so bored durign the meeting that you left early\" vs. \"When you left the meeting twenty minutes before your report was to be given...\"\n\n- Make your behavior description an objective statement rather than a judgment:\n\n  \"When you say women are incapable of being effective managers...\" vs. \"When you behave like a chauvinistic pig...\"\n\n- Avoid absolutes, such as \"never\", \"always,\" and \"constantly\":\n\n  \"When you constantly interrupt me...\" vs. \"When you interrupt me before I have completed my statement...\"\n\n- Avoid profanity:\n\n  \"When you drag your ass in here late for supper night after night...\" vs. \"When you do not call me to let me know you will be late for supper...\"\n\n- Keep subtle judgments from creeping in:\n\n  \"When you overspend our clothing budget...\" vs. \"When you waste our hard-earned money on unnecessary clothing...\"\n\n- Be brief to reinforce clarity:\n\n  \"When you are frequently late for supper...\" vs. \"When you get all invovled in your football game and forget about the family and come home late and all dirty for dinner...\"\n\n- The entire message should be compressed into a single sentence\n\n- Ensure that you are addressing a real issue and not another topic than the one that is really troubling you\n\n- Ensure that you are being assertive to the right person: is this really the person you are having an issue with?\n\n- If you cannot find a tangible effect on your physical or psychological space, you might be attempting to impose your values on the other person:\n\n  \"When you wear jeans to the school play it annoys me and I feel irritated.\"\n\n- Don't try to send an assertion for a third party. Let them send their own.\n\n### More examples\n\n|                                       | Behavior Description                                    | Disclosure of Feeling   | Tangible Effect                                       |\n| ------------------------------------- | ------------------------------------------------------- | ----------------------- | ----------------------------------------------------- |\n| Costs money                           | When you use my car and don't refill the gas tank       | I feel unfairly treated | because I have to pay more money for gasoline         |\n| Harms possessions                     | When you borrow my tools and leave them out in the rain | I feel annoyed          | because they become rusty and don't work well         |\n| Consumes time                         | When you are frequently late to pick me up after work   | I feel frustrated       | because my time is wasted while I wait for you        |\n| Interferes with effectiveness at work | When you call me at work and talk at length             | I feel tense            | because I don't get all my work done on schedule      |\n| Causes extra work                     | When you do not put your dirty clothes in the hamper    | I feel irritated        | because it makes extra work for me when I do the wash |\n\n## Why these work\n\nThese are Bolton's reasons for believing that three-part assertion messages work and are effective[^psch9]:\n\n1. There is a high probability that the other will alter the troublesome behavior\n2. There is a low probability that I will violate teh other person's space\n3. There is little likelihood that of diminishing the other person's self-esteem\n4. There is low risk of damaging the relationship\n5. There is a low risk of diminishing motivation\n6. THere is little likelihood that defensiveness will escalate to destructive levels\n\n[^psch9]: Bolton, People Skills, Chapter 9.\n","outboundLinks":[],"inboundLinks":[{"id":"six-step-assertiveness-process","context":"Write the **Three-Part Assertion Message**","title":"A six-step assertion process"}]}},"__N_SSG":true}